---
kind: type
id: T:Autodesk.Revit.DB.PanelType
source: html/3a8ad72e-5aa7-8fef-10ba-72041fe47346.htm
---
# Autodesk.Revit.DB.PanelType

An object that represents a curtain panel type.

## Syntax (C#)
```csharp
public class PanelType : FamilySymbol
```